[
  {
    "id": "IT2025-1752642774488",
    "name": "ASUS RT-AX57 AX3000 Dual Band WiFi Router",
    "brand": "Asus",
    "brandDescription": "This is the global brand",
    "brandLogo": "",
    "supplier": "Startech",
    "addedDate": "2025-07-16",
    "pricePerUnit": 12000,
    "stock": 0,
    "unit": "Piece",
    "category": "Network",
    "rating": 2.8,
    "image": "https://www.startech.com.bd/image/cache/catalog/router/asus/rt-ax57/rt-ax57-01-500x500.webp",
    "description": "ASUS RT-AX57 AX3000 3000mbps Dual Band WiFi 6 Gaming Router\nThe ASUS RT-AX57 AX3000 Wireless Dual-Band Gigabit Router is designed to provide smooth 4K video streaming, online gaming, and internet browsing experiences for your home network. With Wi-Fi 6 (802.11ax) technology, ASUS RT-AX57 AX3000 Dual Band WiFi 6 Router offers long-reaching coverage and can transfer up to 2976 Mb/s over the 2.4 and 5 GHz bands with compatible devices. It is powered by a 1.7 GHz quad-core processor with four external antennas, which can transfer up to 2402 Mb/s on the 5 GHz band and 574 Mb/s over the 2.4 GHz frequency. ASUS RT-AX57 AX3000 Dual Band WiFi 6 Router also offers BSS Coloring technology to improve Wi-Fi connection efficiency with compatible devices, even in crowded environments. ASUS RT-AX57 AX3000 Dual Band WiFi 6 Router comes with four Gigabit Ethernet LAN ports for wired devices and AiProtection Classic features for added security. The ASUS Router App allows for easy management and setup from your iOS or Android device, and AiMesh Compatibility allows you to expand your Wi-Fi coverage with any ASUS AiMesh compatible router as a mesh network satellite. The Instant Guard VPN technology provides safe internet access through your home network while using public Wi-Fi.\n\nBuy ASUS RT-AX57 AX3000 Dual Band WiFi 6 Gaming Router from Star Tech\nIn Bangladesh, you can get original ASUS RT-AX57 AX3000 3000mbps Dual Band WiFi 6 Gaming Router From Star Tech. We have a large collection of latest ASUS Router to purchase. Order Online Or Visit your Nearest Star Tech Shop to get yours at lowest price. The ASUS RT-AX57 AX3000 Dual Band WiFi 6 Router comes with 2 years warranty.",
    "specifications": {},
    "commonId": "ASUS-RT",
    "uniqueId": "DSA-1752642747292-923",
    "networkItem": "Router",
    "subcategory": "",
    "model": ""
  },
  {
    "id": "IT2025-1752645505642",
    "name": "ASUS RT-AX52 AX1800 Dual Band WiFi Router",
    "brand": "Asus",
    "brandDescription": "This is the global brand",
    "brandLogo": "",
    "supplier": "Startech",
    "addedDate": "2025-07-16",
    "pricePerUnit": 7000,
    "stock": 0,
    "unit": "Picec",
    "category": "Network",
    "rating": 3.3,
    "image": "https://www.startech.com.bd/image/cache/catalog/router/asus/rt-ax52-ax1800/rt-ax52-ax1800-01-500x500.webp",
    "description": "Asus RT-AX52 AX1800 1800mbps Dual Band Gigabit Wi-Fi 6 AiMesh Router\nThe Asus RT-AX52 AX1800 Dual Band Gigabit WiFi 6 AiMesh Router is a cutting-edge networking solution that delivers ultra-fast, dependable, and efficient wireless connectivity to your home or workplace. The RT-AX52, which uses the newest 802.11ax WiFi 6 standard, outperforms prior versions in terms of performance and efficiency. With a total networking speed of up to 1800 Mbps, it provides 574 Mbps on the 2.4GHz band and an astonishing 1201 Mbps on the 5GHz band, guaranteeing fast internet access for all of your devices. The RT-AX52 AX1800 has innovative technologies such as 1024-QAM (Quadrature Amplitude Modulation), which greatly improves wireless connection rates for demanding applications like streaming, gaming, and huge file transfers. It supports the MU-MIMO (Multi-User, Multiple Input, Multiple Output) and OFDMA (Orthogonal Frequency Division Multiple Access) protocols. MU-MIMO enables the router to connect with numerous devices at the same time, whereas OFDMA optimizes channel allocation to reduce latency and improve overall network efficiency. The RT-AX52 AX1800 works with AiMesh-compatible routers to provide expanded coverage and smooth connectivity across your house, allowing you to build a full mesh network with sophisticated capabilities. This provides a continuous and strong WiFi connection in every area of your home. The Asus RT-AX52 AX1800 provides a cutting-edge WiFi experience with fast speeds, efficient technologies, and easy network extension features. It is an excellent solution for anyone looking to enhance their home or office network to the highest levels of speed and performance.\n\nBuy Asus RT-AX52 AX1800 1800mbps Dual Band Gigabit Wi-Fi 6 AiMesh Router from Star Tech\nIn Bangladesh, you can get original Asus RT-AX52 AX1800 1800mbps Dual Band Gigabit Wi-Fi 6 AiMesh Router From Star Tech. We have a large collection of the latest Asus Router to purchase. Order Online Or Visit your Nearest Star Tech Shop to get yours at the lowest price. The Asus RT-AX52 AX1800 1800mbps Dual Band Gigabit Wi-Fi 6 AiMesh Router comes with 2 years of warranty.",
    "specifications": {},
    "commonId": "ASUS-RT",
    "uniqueId": "DSF-1752645480046-954",
    "networkItem": "Router",
    "subcategory": "",
    "model": ""
  },
  {
    "id": "IT2025-1752666625674",
    "name": "ASUS TUF Gaming AX4200 Dual-Band WiFi 6 Gaming Router",
    "brand": "Asus",
    "brandDescription": "This is the global brand",
    "brandLogo": "",
    "supplier": "Startech",
    "addedDate": "2025-07-16",
    "pricePerUnit": 16000,
    "stock": 0,
    "unit": "Piece",
    "category": "Network",
    "rating": 4,
    "image": "https://www.startech.com.bd/image/cache/catalog/router/asus/tuf-gaming-ax4200/tuf-gaming-ax4200-500x500.webp",
    "description": "Specification\nKey Features\nData Rate\n802.11a : up to 54 Mbps\n802.11b : up to 11 Mbps\n802.11g : up to 54 Mbps\nWiFi 6 (802.11ax) (2.4GHz) : up to 574 Mbps\nWiFi 6 (802.11ax) (5GHz) : up to 3603 Mbps\nAntenna\nExternal antenna x 4\nButton\nWPS Button, Reset Button, Power Button\nFrequency\n2.4 GHz / 5 GHz\nWireless\nIPv6\nWi-Fi Encryption : WPS support, WPA/WPA2/WPA3-Personal, WPA/WPA2-Enterprise\nUTF-8 SSID\nGuest Network\nMaximum Guest Network rule : 2.4GHz x3, 5GHz x3\nGuest Network Connection time limit\nWPS\nWiFi MAC address filter\nMaximum MAC filters : 64\nWireless scheduler\nAirtime fairness\nRADIUS Client\nUniversal beamforming\nExplicit beamforming\nNetwork Standard\nIEEE 802.11a\nIEEE 802.11b\nIEEE 802.11g\nIEEE 802.11n\nIEEE 802.11ac\nIEEE 802.11ax\nIPv4\nIPv6\nPorts\nRJ45 for 2.5 Gigabits BaseT for WAN x 1,\nRJ45 for Gigabits BaseT for LAN x 4,\nUSB 3.2 Gen 1 x 1,\nPower Source\nPower Mode\nAC Input : 100V~240V (50~60Hz)\nDC Output : 12 V with max. 2.5 A current\nPhysical Dimension\nWeight\n547.4 g\nColor\nBlack\nManufacturer warranty\nWarranty\n2 years",
    "specifications": {},
    "commonId": "ASUS-TUF",
    "uniqueId": "ASUSTUF-1752666513734-236",
    "networkItem": "Router",
    "subcategory": "",
    "model": ""
  },
  {
    "id": "IT2025-1752668892912",
    "name": "AX5400 Dual-Band Gigabit Wi-Fi 6 Router",
    "brand": "TP-Link",
    "brandDescription": "TP-Link is a global provider of networking and smart home products, founded in 1996",
    "brandLogo": "https://w7.pngwing.com/pngs/347/185/png-transparent-tplink-2-hd-logo-thumbnail.png",
    "supplier": "Tplink",
    "addedDate": "2025-07-16",
    "pricePerUnit": 12000,
    "stock": 0,
    "unit": "Piece",
    "category": "Network",
    "rating": 0,
    "image": "https://static.tp-link.com/Archer_AX73(US)1.0_A_rgb_normal_1598425219977h.jpg",
    "description": "AX5400 Dual-Band Gigabit Wi-Fi 6 Router\nGigabit WiFi for 8K Streaming – 5400 Mbps WiFi for faster browsing, streamings, and downloading, all at the same time.† \nFully Featured Wi-Fi 6 – Equips with the top structure of 4T4R and HE160 on the 5 GHz band to enable 4.8 Gbps ultra-fast connection.\nConnect 200+ Devices§ – Supports MU-MIMO and OFDMA to reduce congestion and quadruple the average throughput.‡** \nExtensive Coverage – 6× antennas and Beamforming ensure broad coverage.\nHomeShield – TP-Link's premium security services keep your home network safe with cutting-edge features for network and IoT protection.*\nMore Vents, Less Heat – Improved vents area unleash the full power of the whole machine.\nUSB Sharing – 1× USB 3.0 port enables easy media sharing and private cloud building.\nEasy Setup – Set up the router in minutes with Tether app.\nLink Aggregation – Static Link Aggregation (LAG) available with 2× LAN ports",
    "specifications": {},
    "commonId": "AX5400",
    "uniqueId": "AX5400-1752668768091-407",
    "networkItem": "Router",
    "subcategory": "",
    "model": ""
  },
  {
    "id": "IT2025-1752670000010",
    "name": "D-Link DIR-841 AC1200 MU-MIMO Wi-Fi Router",
    "brand": "D-Link",
    "brandDescription": "Offers a range of routers for home and business",
    "brandLogo": "",
    "supplier": "DLinkBD",
    "addedDate": "2025-07-16",
    "pricePerUnit": 0.01,
    "stock": 0,
    "unit": "Piece",
    "category": "Network",
    "rating": 0,
    "image": "https://www.dlink.ru/up/prod/600/DIR-841GF_A2_.jpg",
    "description": "D-Link DIR-841 AC1200 Wi-Fi Router features dual-band connectivity with MU-MIMO technology for faster and more efficient performance. Supports speeds up to 1200 Mbps (300 Mbps on 2.4 GHz + 867 Mbps on 5 GHz). Four external antennas improve coverage. Includes advanced security with WPA3 encryption and easy setup with the D-Link Wi-Fi app. Ideal for HD streaming and online gaming.",
    "specifications": {},
    "commonId": "DLINK-DIR",
    "uniqueId": "DLINK-1752670000010-100",
    "networkItem": "Router",
    "subcategory": "",
    "model": ""
  },
  {
    "id": "IT2025-1752670000020",
    "name": "Netgear Nighthawk AX8 8-Stream AX6000 Wi-Fi 6 Router",
    "brand": "Netgear",
    "brandDescription": "Known for high-performance routers and modems",
    "brandLogo": "",
    "supplier": "NetgearBD",
    "addedDate": "2025-07-16",
    "pricePerUnit": 0.01,
    "stock": 0,
    "unit": "Piece",
    "category": "Network",
    "rating": 0,
    "image": "https://www.netgear.com/media/RAX80_tech_specs_image_2_tcm148-96380.png",
    "description": "Netgear Nighthawk AX8 8-Stream WiFi 6 Router delivers up to 6 Gbps speeds with advanced OFDMA and MU-MIMO for simultaneous streaming to multiple devices. Powered by a 64-bit 1.8GHz quad-core processor, it offers exceptional performance for 4K UHD streaming, gaming, and smart home connectivity. Includes 5 Gigabit Ethernet ports, WPA3 security, and the Nighthawk app for easy setup.",
    "specifications": {},
    "commonId": "NETGEAR-AX",
    "uniqueId": "NETGEAR-1752670000020-101",
    "networkItem": "Router",
    "subcategory": "",
    "model": ""
  },
  {
    "id": "IT2025-1752670000030",
    "name": "Tenda AC10 AC1200 Smart Dual-Band Gigabit Wi-Fi Router",
    "brand": "Tenda",
    "brandDescription": "Tenda is a leading supplier of networking devices and equipment from China.",
    "brandLogo": "https://upload.wikimedia.org/wikipedia/commons/4/40/Tenda_logo.svg",
    "supplier": "TendaBD",
    "addedDate": "2025-07-16",
    "pricePerUnit": 0.01,
    "stock": 0,
    "unit": "Piece",
    "category": "Network",
    "rating": 0,
    "image": "https://ayota.com.bd/cdn/shop/products/cp7iuktf4vit1c91y4gi.jpg?v=1623222472",
    "description": "Tenda AC10 AC1200 Smart Dual-Band Gigabit Wi-Fi Router features 4 powerful antennas and Beamforming+ technology for wide coverage and strong signal. Delivers speeds up to 300 Mbps on 2.4 GHz and 867 Mbps on 5 GHz bands. Supports MU-MIMO for simultaneous connections. Easy setup via Tenda App, perfect for HD streaming and gaming in small homes or apartments.",
    "specifications": {},
    "commonId": "TENDA-AC",
    "uniqueId": "TENDA-1752670000030-102",
    "networkItem": "Router",
    "subcategory": "",
    "model": ""
  },
  {
    "id": "IT2025-1752670000040",
    "name": "Huawei WiFi AX3 Quad-Core Wi-Fi 6 Router",
    "brand": "Huawei",
    "brandDescription": "Huawei is a global technology leader offering networking and telecom solutions.",
    "brandLogo": "https://upload.wikimedia.org/wikipedia/commons/0/08/Huawei_Standard_logo.svg",
    "supplier": "HuaweiBD",
    "addedDate": "2025-07-16",
    "pricePerUnit": 0.01,
    "stock": 0,
    "unit": "Piece",
    "category": "Network",
    "rating": 4.2,
    "image": "https://consumer.huawei.com/dam/content/dam/huawei-cbg-site/common/mkt/pdp/routers/ax3-dual-core/update/img/huawei-ax3-mobi.jpg",
    "description": "Huawei WiFi AX3 Quad-Core Wi-Fi 6 Router offers ultra-fast speeds up to 3000 Mbps with support for OFDMA and MU-MIMO technologies. Features 4 high-gain antennas, low-latency performance, and enhanced security with Huawei HomeSec encryption. Supports Huawei Share for instant device pairing. Ideal for smart home networks with many connected devices.",
    "specifications": {},
    "commonId": "HUAWEI-AX",
    "uniqueId": "HUAWEI-1752670000040-103",
    "networkItem": "Router",
    "subcategory": "",
    "model": ""
  }
]
